//패키지 선언. 해당 파일(클래스)이 해당 패키지내에 위치합니다.
package com.test.java;

//클래스. 코드의 집합
public class Ex02 { //K&R Kernighan and Richie 
	
	//메소드. 코드의 집합
	public static void main(String[] args) { //BSD, Allman
		
		System.out.println("안녕하세요.");		
		
		
		//식별자 명명 규칙
		// - 작업 때 여러가지 요소의 이름을 짓게 된다. 이름을 지을 때 지켜야 하는 규칙
		// - 폴더명, 파일명, 클래스명, 메소드명, 변수명 등등... 모든 이름
		// 1. 영문자 + 숫자 + _
		// 2. 숫자로 시작 불가
		// 3. 의미있게(**********) > 약어 사용X > 풀네임 작성O
		
		
		//들여쓰기 규칙
		// 1. 탭문자
		//	- 작성이 편함
		//	- 환경에 따라 여백의 길이가 다르게 출력
		// 2. 스페이스
		//  - 작성이 불편함
		//	- 환경에 상관없이 일정한 길이로 출력
		
		
		//키보드
		// 1. 노트북 키보드(X)
		// 2. 데탑 + 외장 키보드
		// 3. 노트북 + 외장 키보드
		
		//외장 키보드
		// 1. 유선
		// 2. 무선(블루투스) -> 일정 시간 -> sleep
		
		// 1. 멤브레인
		// 2. 기계식(청축, 갈축, 흑축, 백축, 적축 등..) + 키압(25g~30g 45~50g) -> 체리키 내장
		// 3. 정전압식(무접점) -> 초콜렛 -> 해피해킹프로2
		// 4. 기타 등등..
		
		
		
		
		
	}
	
}



























